ImageMagick-notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-06-18 Wed 16:53 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0" />
<title>ImageMagick Snippets</title>
<meta name="generator" content="Org Mode" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="./apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./favicon-16x16.png">
<meta property="og:title" content="ImageMagick Snippets">
<meta property="og:description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/newfeather.png">
<meta property="og:url" content="https://notes.neeasade.net/ImageMagick-notes.html">
<meta property="description" content="">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=7ca3a7d19d77e07a7aa1b75c41b6c485'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=7ca3a7d19d77e07a7aa1b75c41b6c485'>
<link rel='stylesheet' href='/assets/css/new.css?sum=8ded96c4e22d9cf406740e90fb2c41de'>
<link rel='stylesheet' href='./assets/css/new.css?sum=8ded96c4e22d9cf406740e90fb2c41de'>
<link rel='stylesheet' href='/assets/css/org.css?sum=6f5b128ae2001f1230d4fdc21163a4d6'>
<link rel='stylesheet' href='./assets/css/org.css?sum=6f5b128ae2001f1230d4fdc21163a4d6'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=444396e7a7768e08c9594d95c6234b4a'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=444396e7a7768e08c9594d95c6234b4a'>
</head>
<body>
<div id="content" class="content">
<div style="float: left">
    <a href='/index.html'>../ＳＴＸ</a>
</div>

<div style="float: right">
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/2020-08-03-ImageMagick-notes.org">source</a>
</div>
<h1 class=title>ImageMagick Snippets</h1>
<div class="org-center">
<p>

</p>
</div>
<div class=pubinfo
Published 2020-08-03, last edit <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/2020-08-03-ImageMagick-notes.org">2024-03-01</a>
</div>
<hr>
<p>
<b>NB:</b> The convert command is deprecated in IMv7, use &ldquo;magick&rdquo; instead of &ldquo;convert&rdquo; or &ldquo;magick convert&rdquo;
</p>

<p>
inspo sites:
</p>

<ul class="org-ul">
<li><a href="http://www.fmwconcepts.com/imagemagick/index.php">http://www.fmwconcepts.com/imagemagick/index.php</a></li>
<li><a href="http://im.snibgo.com/">http://im.snibgo.com/</a></li>
</ul>
<div id="outline-container-h-311d42c6-cd20-4f19-922e-8df55e7fee07" class="outline-2">
<h2 id="h-311d42c6-cd20-4f19-922e-8df55e7fee07"><span class="section-number-2">1.</span> Rotate a tiled image 45 degrees <span class=anchor><a href="#h-311d42c6-cd20-4f19-922e-8df55e7fee07">#</a></span></h2>
<div class="outline-text-2" id="text-h-311d42c6-cd20-4f19-922e-8df55e7fee07">
<p>
Better results with square images, of course. The <code>45</code> is the degree amount.
</p>

<div class="org-src-container">
<pre class="src src-sh">magick in.png -matte -virtual-pixel tile +distort ScaleRotateTranslate <span style="color: #cb7000;">'1  1  45'</span> out.png
</pre>
</div>
</div>
</div>
<div id="outline-container-h-ac358ddb-6701-4782-8641-22946fc54b18" class="outline-2">
<h2 id="h-ac358ddb-6701-4782-8641-22946fc54b18"><span class="section-number-2">2.</span> Stack images vertically <span class=anchor><a href="#h-ac358ddb-6701-4782-8641-22946fc54b18">#</a></span></h2>
<div class="outline-text-2" id="text-h-ac358ddb-6701-4782-8641-22946fc54b18">
<div class="org-src-container">
<pre class="src src-sh">magick 1.jpg 2.jpg 3.jpg -gravity center -append out.jpg
</pre>
</div>
</div>
</div>
<div id="outline-container-Create-a-solid-color-image" class="outline-2">
<h2 id="Create-a-solid-color-image"><span class="section-number-2">3.</span> Create a solid color image <span class=anchor><a href="#Create-a-solid-color-image">#</a></span></h2>
<div class="outline-text-2" id="text-Create-a-solid-color-image">
<div class="org-src-container">
<pre class="src src-sh">magick -size 100x100 <span style="color: #cb7000;">"xc:#cccccc"</span> out.png
</pre>
</div>
</div>
</div>
<div id="outline-container-Rotate-a-tiled-image-an-arbitrary-degree" class="outline-2">
<h2 id="Rotate-a-tiled-image-an-arbitrary-degree"><span class="section-number-2">4.</span> Rotate a tiled image an arbitrary degree <span class=anchor><a href="#Rotate-a-tiled-image-an-arbitrary-degree">#</a></span></h2>
<div class="outline-text-2" id="text-Rotate-a-tiled-image-an-arbitrary-degree">
<p>
see also: <a href="https://github.com/neeasade/dotfiles/blob/master/bin/bin/tiletilt">tiletilt</a>
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #0095ac;">tile</span>=<span style="color: #cb7000;">"some_file.png"</span>
<span style="color: #0095ac;">angle</span>=$(<span style="color: #0095ac;">(RANDOM % 360</span>))
<span style="color: #0095ac;">w</span>=1920
<span style="color: #0095ac;">h</span>=1080

magick <span style="color: #cb7000;">"$tile"</span> -set option:distort:viewport <span style="color: #cb7000;">"${w}x${h}"</span> <span style="color: #cb7000;">\</span>
    -virtual-pixel tile -filter point <span style="color: #cb7000;">\</span>
    -distort SRT <span style="color: #cb7000;">"$angle"</span> <span style="color: #cb7000;">\</span>
    -gravity center -crop <span style="color: #cb7000;">"${w}x${h}+0+0"</span> +repage <span style="color: #cb7000;">\</span>
    <span style="color: #cb7000;">"result.png"</span>
</pre>
</div>

<div class="footer-center">
    
</div>
</div>
</div>
</div>
</body>
</html>
